Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] [WEBTOON] Ganda: Night Defender.tmx
Source language: id
Languages: en

source: apa jin yang dibawa aksel lemah sekali?
en: Are the jinns that Aksel brought too weak?

source: pak satpam?!
en: Mr. Security Guard?!

source: aku bisa menang tidak, aku harus menang.
en: Can I win this...? No, I have to win!

source: madama... mungkin saya lancang, tapi kami akan berusaha melindungi manusia di sini.
en: madama... I may sound audacious, but we’ll do our best to protect everyone.

source: ukh...
en: ugh...

source: dirimu yang sebenarnya...
en: the real you is...

source: kalau begitu, aku serahkan ini pada kalian.
en: then I leave it all to you.

source: karena itu, saya percaya kalian bisa membukakan jalan.
en: that’s why I trust you all to clear the way for me.

source: nah, madama.
en: well, madama.

source: aku raja dari para jinn yang ada di tanah ini, dan tempat ini sudah menjadi rumahku sejak ribuan tahun lalu.
en: I’m the king of all jinns in this place. this ground has been my home for thousands of years.

source: tidak, aku masih bisa merasakannya. pasti ada cara untuk menyelamatkannya.
en: no, I can still feel his presence. there must be a way to save him.

source: tidak.
en: no.

source: walaupun kita semua sampai di aula, hanya aku _x0003_dan dhasa yang bisa berhadapan dengan madama.
en: even if we’re all arrived safely at the hall, only dhasa and I that are capable to face madama.

source: badut.
en: What a clown.

source: TERKADANG SAAT MENGERJAKAN KOMIKNYA SERING BUAT CORET-CORETAN KARAKTER-KARAKTERNYA (SAKING SERUNYA!).
en: when I was working on this comic, I even made some doodles of the characters because it was so much fun!

source: kau mendengarnya.
en: you heard her.

source: SAATNYA KITA MENINGGALKAN TEMPAT INI.
en: it’s time for us of leave this place.

source: heh, tidak buruk.
en: huh, not bad.

source: MISALNYA, TIBA-TIBA KAMU DITELPON.
en: for example, maybe your phone would start ringing...

source: SAYA… AKAN TETAP DI SINI.
en: I... I’m going to stay here.

source: PESTAA!
en: let’s feast!

source: dia tidak di sini.
en: is not here

source: madama... memilihnya?
en: Has madama... chosen her?

source: walaupun kekuatanku sudah hilang...
en: even though I no longer have my power...

source: kembalikan tubuh pak ganda!
en: stay away from mr. ganda’s body!

source: kamu bisa berbuat apapun yang kamu mau, selama kamu memiliki kemampuan itu.
en: you can do whatever you want as long as you have the power to do so.

source: salah!
en: you’re wrong!

source: aku percaya... rika dan pak ganda tidak akan kalah!
en: I believe... rika and mr. ganda will prevail!

source: BERBAGAI KEJADIAN TERJADI.
en: a lot of things happened.

source: ini bukan dirimu yang sebenarnya.
en: You’re not being yourself!

source: hanya di dunia ini mereka menaruh harapan padaku.
en: only in this world, people depend on me.

source: aku tahu sepenuhnya potensi dalam kalian. kau pikir, kenapa aku bekerja sama dengan manusia?
en: I know very well of your kind’s potential. why do you think have I been working with a human the whole time?

source: Tidak.
en: no.

source: lihat dirimu, begitu bergantung pada kekuatan madama.
en: look at you, struggling to stop depending on madama’s power.

source: Dan aku percaya Rika akan mengambil keputusan yang benar!
en: and I believe rika will also make the right one!

source: walau pun begitu, kami sudah mengambil keputusan...
en: that being said, we made our decision...

source: walau apapun pilihan yang kamu ambil akan ada konsekuensinya.
en: however, there will always be consequences behind one’s decision.

source: ini bukan dirimu!
en: this isn’t you!

source: tubuh manusia yang selalu berkembang adalah tumbal terbaik untuk kita, kaum Jinn!
en: the body of a human who steadily grows is the best host for us jinns!

source: apa?
en: what?

source: aku tidak punya ambisi atau cita-cita seperti mereka. hanya hidup.
en: I don’t have any ambitions or goals like them. I just live.

source: Dan aku akan mempercayai mereka yang menggunakan kekuatan itu untuk melawan.
en: I believe those two will make use of their power and come out victorious.

source: SAYA TIDAK PERLU MENGURUS KALIAN TERLAMBAT ATAU TIDAK.
en: I don’t care whether you’re late or not.

source: semakin kita mendekati aula, semakin besar kemungkinan kita diserang.
en: the closer we are to the hall, the bigger the possibility for us to get attacked.

source: kau bodoh karena membuang tubuh yang masih sempurna.
en: you’re such a fool for abandoning this powerful body.

source: SEMUANYA!
en: hey, everyone!

source: ini harus berhasil... kalau tidak...
en: this will have to work... if not...

source: ngmong apa lu?!
en: what did you just say?!

source: kau boleh saja berpikir begitu, tapi itu bukan pilihanmu.
en: you may think that, but the choice is not yours to make.

source: tunggu, madama!
en: wait, madama!

source: sudah saatnya bagimu untuk pergi dari kampus ini.
en: Isn’t time for you to leave this campus?

source: apa yang terjadi?
en: what happened?

source: TERIMA KASIH JUGA UNTUK KOSMIK YANG SUDAH MEMPERBOLEHKAN UNTUK IKUT DALAM PEMBUATAN KOMIK INI!
en: also, thank you kosmik for giving us the opportunity to be involved in the production process of this comic!

source: semua yang aku lakukan biasa- biasa saja, cuma aku lakukan selewatnya.
en: everything I do is just ordinary. I never put my heart into anything.

source: tubuh ini cukup untuk menghancurkanmu.
en: this body is sufficient to destroy you.

source: id_ID
en: en_EN

source: dia tidak siap menerima kekuatan ini!
en: she’s not ready to withhold this power!

source: apa kamu bisa menemukan rika?
en: can you find her?

source: LEWAT SINI AJA, YUK.
en: wanna go this way?

source: aku senang kamu baik- baik saja.
en: I’m glad you’re okay.

source: HA?
en: Huh?

source: Aku tertantang.
en: I feel challenged.

source: kami akan mengalahkanmu, nihaya.
en: we will defeat you, nihaya.

source: KALIAN KAN SUDAH KULIAH, BUKAN ANAK SEKOLAH LAGI.
en: you’re a university student, not a high schooler anymore.

source: OOH!
en: wow!

source: tubuhmu sudah tidak bisa lagi menggunakan kekuatanku. ini sudah maksimal.
en: your body can no longer hold my power. you’ve reached your limit.

source: musuhku mulai bergerak dan aku harus bertahan.
en: my enemy has started moving and I have to defend myself.

source: rika, awas!
en: rika, look out!

source: KALAU BEGITU, SAYA AKAN MENDUKUNG KEPUTUSANMU.
en: then I’ll support your decision.

source: KALIAN TIDAK PERLU MERASA HARUS MEMBALAS HUTANG BUDI PADAKU LAGI.
en: you guys don’t owe me anything anymore.

source: mengalahkan? tidak.
en: defeat? no.

source: kalau itu terjadi, bersembunyilah!
en: if that happens, we need to hide!

source: karena itulah, aku menemukan tubuh baru yang bisa menampung kekuatan ini.
en: Therefore, I’ve found a new vessel that can contain this power.

source: ukh!
en: argh!

source: DIA SUDAH PUNYA JINN SEBELUM MASUK KE SINI, HANYA SAJA JINN ITU MENJADI SEMAKIN KUAT SETELAH ORANG ITU BERDIA.
en: he already has this jinn before coming here, and now the jinn got stronger because he prayed to him.

source: TERLAMBAT?
en: you’re late?

source: hidup ini lebih dari tugas utamamu! ada lebih banyak yang harus kamu temui di hidup ini, rika.
en: this life is much more than your ambition, rika! there are a lot of things you haven’t experienced yet!

source: SKRIPSI JUGA AKAL-AKALAN JINN
en: my thesis is a jinn’s deception too, i guess...

source: kerajaanmu kini tidak ada artinya, madama!
en: your kingdom means nothing now, madama!

source: INI KAN MUTER, KAMU MAU NGAPAIN, SIH?
en: this route is way longer, you know... why’d you wanna go this way?

source: SALAH SATUNYA YANG DIAWALI DENGAN BERBAGAI PENYAKIT (SAMPAI HARUS OPERASI), FILE YANG RUSAK SECARA MISTIS, DAN DIAKHIRI DI EPISODE TERAKHIR DENGAN COVID-19.
en: some of us were sick (someone in the team even went through an operation), some of the files were “mysteriously” corrupted, and the production process was accompanied by the pandemic.

source: tidak...
en: no...

source: tidak, pak ganda. ini aku.
en: no, mr. ganda, it’s me.

source: aku mengerti.
en: I see.

source: “kami?”
en: “we”?

source: kami ke sini karena dipanggil kak emi...
en: emi’s asked us to come here...

source: SEDANG KAN AKU…
en: meanwhile, I...

source: aku akan pergi duluan!
en: I will move first!

source: maaf tapi aku harus menyerahkan tanggung jawab menjaga jinn di tempat ini pada kalian.
en: Sorry, but I’m afraid you two will have to bear the responsibility of controlling the jinns.

source: kalian bermain dengan kekuatan yang tidak kalian kenal, berharap membuat perubahan pada hal yang jauh di luar kekuatan kalian.
en: you’ve messed with something beyond your capabilities, hoping to make changes to something beyond your control.

source: belajar, mengerjakan tugas, main...
en: studying, doing homework, going around town...

source: aah, tentu saja kalau kamu bilang seperti itu, tawarannya menarik sekali.
en: well, when you put it like that, your offer is indeed tempting.

source: jangan lengah. madama pasti siap dan sudah menyimpan pasukan jinnya untuk menghalau kita.
en: stay sharp. madama must have already expected this and prepared her army to attack us.

source: kalau kau tidak siap melawan muridmu sendiri.
en: if you’re not ready to go against your own student...

source: kenapa...aku bisa mengalahkan jinn itu dengan mudah?
en: How did I manage to beat that jinn so easily?

source: kami akan belajar sampai bisa.
en: we will try our best.

source: akhirnya kita bertemu, madama. aku--
en: we meet at last, madama. I--

source: perasaan ini lagi... sama seperti waktu pak ganda memanggil kami!
en: this feeling again... just like that time when mr. ganda called us!

source: aku harus kembali ke sana bagaimanapun caranya.
en: I need to get back to her, no matter what.

source: situasi berubah.
en: the situation is different now.

source: kenapa? tentu saja untuk mengeluarkanmu dari sini.
en: why? to get you out of here, of course.

source: pak ganda!
en: mr. ganda!

source: aku harus tetap di siini untuk mengendalikan para jinn dan aku butuh bantuan kalian.
en: I must stay here to control the jinns, and I need your help.

source: sudah kubilang, kau harus siap dengan apapun yang kau hadapi di tempat ini, ganda.
en: I told you, you had to be prepared with anything once you set your foot in this place, ganda.

source: NAH, KITA LANJUTKAN, YA….
en: okay, let’s continue...

source: LAWAN KITA APA?
en: so, what are we dealing with tioday?

source: kalau aku ada di sini...
en: if I keep doing this...

source: ah, air suci. trik murahan yang diciptakan manusia.
en: ugh, holy water. a cheap trick made by filthy humans.

source: Menjadi lebih ahli.
en: I want to be better.

source: tugasmu sudah selesai.
en: your job is done.

source: kamu boleh mundur sekarang. aku tidak akan memaksa.
en: you have the option to back off, I won’t force anything on you.

source: (DARI PENULIS)
en: (from the writer)

source: deden, kita harus mengobati lukamu.
en: deden, we need to treat your wound!

source: tapi, aku yang bodoh ini malah diajarkan sesuatu oleh rika.
en: but, an airhead like me just have learned something from rika.

source: heaaa!
en: haaa!

source: baik.
en: okay.

source: madama tidak akan bisa mempengaruhi pikiranmu malam ini.
en: madama won’t be able to mess with your mind tonight.

source: aku pasti bisa!
en: I can do this!

source: SEKALI LAGI TERIMA KASIH SEMUANYA!
en: again, thank you everyone!

source: SAYA AKAN BERUSAHA LEBIH BAIK LAGI!
en: I’ll try my best to improve myself!

source: siapapun yang mencoba mengubah takdir itu harus menangung sendiri penderitaan yang akan mereka alami.
en: anyone who tries to stop that nature shall carry the burden of the suffering within oneself.

source: Hidupku tidak lebih penting daripada hidup seluruh umat manusia
en: My life is nothing compared to the the survival of the human kind.

source: maaf, pak ganda aku banyak urusan.
en: sorry mr. ganda, I was kinda busy.

source: kalau cuma jinn biasa sih kita semua bisa melawan!
en: no regular jinn can stand a chance against us!

source: KATANYA, DI DAERAH TIMUR ATAU SELATAN, JINN-NYA KUAT-KUAT DAN BERBAHAYA, AKU PENASARAN.
en: they said the jinns in the east and the south area were quite strong and dangerous. I’m curious.

source: hah?!
en: huh?!

source: seperti manusia yang tidak bisa hidup tanpa memangsa makhluk lain, jinn juga tidak bisa hidup tanpa memangsa manusia.
en: just like humans that can’t live without eating other creatures, jinns can’t live without devouring humans.

source: ayo kita ke klinik dulu.
en: let’s go to the clinic.

source: kalau begitu, saya akan minta yang lain untuk datang ke sini.
en: well, then I’ll ask the others to come here.

source: tidak!
en: no!

source: ada apa, rika?
en: what is it, rika?

source: tapi sekarang aku harus bisa!
en: but now, I have to do it!

source: ADA KEJADIAN APA YA YANG BIKIN AKSEL JADI BEGITU
en: did something happen to him?

source: ini bukan pertarungan yang bisa kumenangkan.
en: this is not a fight I can win!

source: KENAPA DIEM?
en: spit it out.

source: aksel adalah teman kami. kesalahannya adalah tanggung jawabku.
en: aksel is our friend. I am responsible for what he’s done.

source: keluar dari situ, nihaya!
en: get out, nihaya!

source: ah, sial!
en: damn!

source: akh, menyebalkan! dhasa mungut orang- orang kayak gini dari mana, sih?!
en: argh, so annoying! where did dhasa find these people?!

source: musuh kita yang sesungguhnya adalah nihaya!
en: it’s nihaya!

source: INI PROSES YANG SEBENARNYA SANGAT BERAT, TAPI BISA DILAKUKAN BERKAT DUKUNGAN SEMUANYA!
en: It was quite difficult, but you guys were always there, supporting me along the way!

source: dia selalu gamang dalam dua dunia, antara ingin menjalankan tugasnya sebagai penjaga, atau menjadi manusia.
en: he struggled to find his place between the two worlds. he didn’t know whether he wanted to be a guardian or a human.

source: aku akan memegang janji kalian.
en: I will hold on to that promise.

source: tapi ini satu-satunya jalan untuk menyelamatkan rika.
en: but, this is the only way to save rika.

source: TERIMA KASIH UNTUK KAK DEWE YANG SUDAH MEMBUAT CERITA YANG SANGAT SERU.
en: thank you dewe for writing this amazing story!

source: tenanglah. aku juga tidak berniat buruk.
en: calm down, I have no ill intention.

source: sampai...
en: However...

source: sehingga tidak ada lagi yang menderita.
en: so nobody will suffer anymore.

source: tapi kau tidak pernah mau melakukan lebih dari itu.
en: but you’ll never have the guts do more than that.

source: tapi dia benar... kekuatan jinn mereka lebih efektif daripada kita!
en: he’s right, though... these jinns are more powerful than us!

source: dan dia pasti sudah di sini sekarang.
en: I bet he’s here already.

source: kepentingan kita berbenturan.
en: our interests clash with each other.

source: dia berusaha untuk tidak menyakiti manusia dan jinn. pada akhirnya tubuhnya tidak sanggup menanggung beban itu.
en: he tried so hard not to hurt both humans and jinns, and in the end his body was unable to carry such burden.

source: THANK YOU REN M(_ _)M
en: thank you rendi M(_ _)M

source: selamat datang kembali, rika.
en: welcome back, rika.

source: SEKARANG.
en: now.

source: haruskah aku memutuskannya sekarang?
en: Do I have to make my decision right this instant?

source: BAGAIMANA INI?
en: what should I do?

source: ...gerbang depan?!
en: I’m at the front gate?

source: suka atau tidak, dia bisa.
en: whether we like it or not, he’s our only option.

source: MAAF YA, KITA GANGGU KENCAN KAMU.
en: sorry to bother your little date, rika.

source: beberapa menit yang lalu...
en: a few minutes ago...

source: apa benar rika yang melakukan ini?
en: is it true that rika did this?

source: OKE.
en: okay.

source: kalian tolong tahan para jinn di sini!
en: please hold off those jinns here!

source: kodrat kita memang berbeda. mengacaukan keharmonisan kedua dunia ini akan berakibat penderitaan pada salah satu satu dunia.
en: we have different nature, and messing with the balance between our worlds will only cause suffering for one of them.

source: jangan sok bisa mengatur jalan hidup kami, jinn bodoh!
en: you have no right tell us how to live our lives, filthy jinn!

source: a... apa?
en: wh-what?

source: urusanku bukan dengan kalian, tapi dengan madama.
en: I have no business with you. all I want is madama.

source: tidak. ini harus berhasil! aku harus percaya pak ganda!
en: no, this will work! I must trust mr. ganda!

source: aku tidak bisa membiarkan manusia mati begitu saja.
en: I can’t just let all of those humans die.

source: bukan.
en: no.

source: saya punya rencana. tapi saya butuh bantuan kamu untuk menahannya.
en: I have a plan, but I need you to hold him off.

source: ORANG-ORANG DI SEKITARKU TERUS BERGERAK MENJALANI KEHIDUPANNYA.
en: people around me keep on moving with their lives.

source: waktu mainmu habis, manusia.
en: play time is over, human.

source: ri... tidak, madama!
en: ri... no, madama!

source: kalau begitu, lakukanlah tanggung jawabmu!
en: then carry out your responsibility!

source: SAYA TADINYA TIDAK MAU MANGGIL, TAPI SEPERTINYA ADA YANG BANDEL MASUK KE KAMPUS.
en: I didn’t want to disturb you, but I think we got a bad one coming into the campus.

source: saat aku berhadapan dengan jinn, saat itu aku merasakan keinginan.
en: when I face a jinn, I feel so alive.

source: AYO KITA HABISKAN PIZZANYA, UNTUK JATAH AKSEL JUGA!
en: let’s finish the pizza and leave nothing for aksel!

source: Rika terlalu baik dan naif untuk menggunakan kekuatan Madama.
en: rika is too kind and naive to use madama’s power.

source: JANGAN KHAWATIR, RIKA!
en: no need to worry!

source: nihayaaa!
en: nihaya!

source: walaupun... sering pula kami minta tolong pada pihak yang salah.
en: sometimes we do depend on the wrong side.

source: MAAF SAYA TERLAMBAT!
en: sorry, I’m late!

source: (DARI ARTIS)
en: (from the artist)

source: keluarga.
en: Your family.

source: prinsip kalian terlalu lemah.
en: your willpower is too weak.

source: walaupun nihaya sudah mati, pasti akan ada jinn lain yang berusaha menggunakan manusia demi ketamakanya.
en: although we’ve defeated nihaya, there will always be another jinn who wants to enslave humans for their own greed.

source: I--IYA!
en: o-okay!

source: APAKAH KITA AKAN LIHAT RIKA DAN GANDA LAGI DI KESEMPATAN LAIN?
en: will we see more of rika and ganda?

source: I-INIKAH… PIZZA ULTRA LARGE YANG KONON BISA UNTUK MAKAN SEPULUH ORANG ITU?!
en: is this the ultra large pizza that supposedly able to feed ten people?!

source: aku ingin menghilangkan titik suci dari kampus ini.
en: I want to destroy the holy grounds in this campus.

source: tunggu, bukannya harusnya “pergilah duluan! aku akan menahan mereka di sini”?
en: wait, shouldn’t you have said, “go ahead! I will hold off these jinns”?

source: kami tidak peduli!
en: we don’t care!

source: SAYA BERTERIMA KASIH ATAS BANTUAN KALIAN SELAMA INI.
en: I thank you for all the things you’ve done.

source: ganda sudah tiada.
en: ganda is gone.

source: kalau kau mengambil kekuatanku, kau akan bisa berbuat apapun terhadap titik suci di tempat ini.
en: if you take my power, you can do whatever you want to those holy grounds.

source: Tapi saya butuh bantuan kalian.
en: but, I need your help.

source: KURASA KOTA-KOTA BESAR SEPERTI YOGYAKARTA SUDAH PUNYA PELINDUNGNYA MASING-MASING.
en: I guess big cities like Yogyakarta have already got their own guardians.

source: tapi rika belum siap!
en: but, she’s not ready!

source: tapi, tidak ada salahnya mencoba.
en: but, there’s no harm in trying.

source: gema sudah capek-capek menyiapkan crossbow buat kita semua!
en: gema has done his best to give us this crossbow!

source: tapi pada akhirnya, manusia melawan.
en: but in the end, humans start to resist.

source: tangkap!
en: catch!

source: ya.
en: yes.

source: dia telah melanggar perintahku untuk tidak ke sini.
en: he’s defied my order to not come here.

source: THANKS YA, RIKA, DEDEN.
en: thank you, rika and deden.

source: AKHIRNYA PERJALANAN GANDA DAN RIKA BERAKHIR DI SINI.
en: the journey of ganda and rika must end here.

source: apa yang dia lakukan? udara di tempat ini berubah...
en: what has he done? the air feels different...

source: ALASAN MACAM APA ITU?!
en: what kind of an excuse is that?!

source: tempat ini...
en: this place...

source: pak ganda, anda tidak apa-apa?
en: mr. ganda, are you alright?

source: TERIMA KASIH UNTUK SEMUANYA YANG SUDAH BACA DAN SUPPORT SAMPAI AKHIR EPISODE!
en: thank you for all the readers who have supported us to the very end!

source: selama pak ganda tidak punya kekuatan, cuma ini jalan kita.
en: as long as mr. ganda is powerless, we don’t have much of a choice, do we?

source: GARA-GARA KAMU AJA JADI MUTER.
en: I’ve taken this route today just because you asked me to.

source: zia berani banget, ya...
en: zia is so brave...

source: hoi rambut anime! asal tahu aja, kita juga udah siap!
en: hey, anime hair! just so you know, we’re all ready to face her!

source: dan sekarang...
en: and now...

source: tunggu!
en: wait!

source: tidak ada.
en: no, there’s not.

source: CERITA KALI INI SANGAT BERKESAN DAN PENUH PERJUANGAN!
en: this project has been so unique and challenging!

source: TABUNGKU DI KAMPUS.
en: my savings in the campus.

source: harusnya aku tidak pernah melibatkan dia seperti ini.
en: I shouldn’t have involved her in all of this.

source: kalian bukan siapa-siapa tanpa kekuatanku.
en: you are nothing without my power.

source: tapi bukan berarti mereka setara.
en: but, that doesn’t mean they’re equal.

source: tempat ini disesaki oleh bau kematian!
en: this place reek of death!

source: kenapa?
en: why?

source: SOALNYA… AKU…
en: because... I...

source: oke!
en: okay!

source: kendalikan dirimu...
en: control yourself...

source: pilihannya ada di tanganmu.
en: the choice is yours.

source: aku bisa menjadi jago dalam suatu hal.
en: I can finally be great at something.

source: tu-tunggu bagaimana mungkin... kamu...
en: w-wait, how could you...

source: …YA SUDAH, DUDUK SAJA.
en: I don’t care, just take your seat.

source: sebelum rika menjadi pelayan madama sepenuhnya.
en: before she’s fully become madama’s servant.

source: AKU SIAP!
en: I’m ready!

source: tidak bisa memilih... adalah pilihan yang tidak akan sanggup kamu bayar.
en: failing to make one... is the worst decision you can make.

source: kenapa? padahal aku tidak tahu apa yang akan aku hadapi.
en: What’s going on with me? I don’t even know what I’m facing.

source: kita tidak tahu apa yang akan kita hada--
en: we don’t know what we’ll be faci--

source: AYO!
en: let’s go!

source: hai, rika.
en: hi, rika.

source: aku merasakan ambisi.
en: I feel ambition.

source: sudah cukup...
en: enough...

source: RIKA ALTERNATE UNIVERSE
en: rika’s alternate universe

source: DAN DENGAN INI, MONACHOPSIS BENAR-BENAR BERAKHIR.
en: with this, the monachopsis is disbanded.

source: TERIMA KASIH JUGA UNTUK KAK RENDI YANG SUDAH SABAR MENGHADAPI KAMI BERDUA, TANPA KAKAK KOMIK INI AKAN BERANTAKAN TERUTAMA JADWALNYA : ))
en: thank you rendi for being so patience with us both. without you, the process of making this comic would’ve been so messy, especially the scheduling part :)

source: tapi apakah kamu mau menerimanya, meskipun itu artinya kamu harus mengorbankan kehidupanmu?
en: are you willing to accept this power, even if it means that you have to sacrifice your life?

source: DI-DIA BILANG KATANYA MAU MENYENDIRI DULU UNTUK MEMPERBAIKI HIDUP.
en: he said that he wanted to be alone for a while to reflect on himself...

source: aku tahu ini egois, dan kalian para jinn jauh lebih kuat daripada kami.
en: I know this sounds selfish, and the jinns are far stronger than us.
